#정준변수, 정준상관계수 계산



> jop<-read.csv("C:/Users/Lee seohyun/Desktop/jop.csv")

> jop


> x<-jop[,1:3]

> y<-jop[,4:6]


> s_xx<-cov(x) #공분산행렬

> s_xx



> s_xy<-cov(x,y)

> s_xy


> s_yx<-cov(y,x)

> s_yy<-cov(y)



> xev<-eigen(s_xx)$values #공분산 행렬의 고유값만 저장

> xevec<-eigen(s_xx)$vectors #고유벡터



> yev<-eigen(s_yy)$values

> yevec<-eigen(s_yy)$vectors


#VlamdaVT

> s_xx_sq <- xevec%*%diag(1/sqrt(xev))%*%t(xevec)   #시그마xx^-1/2

> s_yy_sq <- yevec%*%diag(1/sqrt(yev))%*%t(yevec)   #시그마yy^-1/2



> solve(s_xx_sq%*%s_xx_sq)  #빼도됨 

> solve(s_yy_sq%*%s_yy_sq) 


#PPT A,B계산

> A<-s_xx_sq%*%s_xy%*%solve(s_yy)%*%s_yx%*%s_xx_sq

> B<-s_yy_sq%*%s_yx%*%solve(s_xx)%*%s_xy%*%s_yy_sq



> eigen(A)

eigen() decomposition

$values

[1] 0.84531840 0.17526710 0.01285181

#lamda1   #lamda2     #lamda3

$vectors

[,1]       [,2]       [,3]

[1,] -0.2518513  0.7195039 -0.6472133

[2,] -0.5725339 -0.6499561 -0.4997619

[3,] -0.7802409  0.2446859  0.5756327

#e1        #e2         #e3

> eigen(B)

eigen() decomposition

$values

[1] 0.84531840 0.17526710 0.01285181
#lamda1..p...q


$vectors

[,1]       [,2]       [,3]

[1,] 0.47202587 -0.3221845  0.8206027

[2,] 0.87904495  0.1014052 -0.4658293

[3,] 0.06686964  0.9412301  0.3310805
#f1..fp..fq

#A행렬과 B행렬의 고유값은 동일


#정준계수
#alpha,beta 계산

> alpha<-s_xx_sq%*%eigen(A)$vectors

> beta<-s_yy_sq%*%eigen(B)$vectors

> alpha

[,1]         [,2]        [,3]

[1,]  0.004300092  0.031408316 -0.03519517

[2,] -0.020110886 -0.028134366 -0.01528254

[3,] -0.053120964  0.006447336  0.05245086

#a1^TX=V1(첫번째 정준변수) #a2^TX=v2 #V3 

> beta

[,1]         [,2]        [,3]

[1,] 0.01483783 -0.026536591  0.05099320

[2,] 0.02525192  0.004197075 -0.02920936

[3,] 0.02434304  0.441592020  0.15072041

#B1^TY=w1(첫번째 정준변수) #w2 #w3


#정준변수 
> v<-as.matrix(x)%*%alpha 

[,1]       [,2]        [,3]

[1,] -3.896686  0.4559187  3.15150075

[2,] -5.017181  2.6503531  1.55012475

[3,] -4.787908  1.3050807 -0.05508623

[4,] -6.308442  1.0907961  1.05553919

[5,] -6.546468 -0.4102552  2.64395203

[6,] -4.346331  0.6877583  2.58156897

[7,] -4.171417  1.8465920  1.32982530

[8,] -2.876010  0.4971093  1.72459679

[9,] -3.838006  1.1220412  2.31144671

[10,] -4.963537  0.9087704  3.69713315

[11,] -3.820806  1.2476745  2.17066602

[12,] -4.204714 -1.0178430  0.83949892

[13,] -5.381967  0.3167099  1.88325163

[14,] -4.068238 -0.8523108  0.98167187

#v1        #v2      #v3

> w<-as.matrix(y)%*%beta

> cbind(v,w)


#정준상관계수 = 절댓값corr(v1,w1)
> round(cov(cbind(v,w)),3) #round함수로 3개만 본것 원래는 round아님

#      v1    v2     v3    w1    w2      w3

[,1]  [,2]   [,3]   [,4]  [,5]   [,6]

[1,]  1.000 0.000  0.000 -0.919 0.000  0.000 #v1

[2,]  0.000 1.000  0.000  0.000 0.419  0.000 #v2

[3,]  0.000 0.000  1.000  0.000 0.000 -0.113 #v3

[4,] -0.919 0.000  0.000  1.000 0.000  0.000 #w1

[5,]  0.000 0.419  0.000  0.000 1.000  0.000 #w2

[6,]  0.000 0.000 -0.113  0.000 0.000  1.000 #w3

#v의공분산0 ,분산1 #cov(v1,w1)=0.9,cov(v2,w2)=0.4 #cov(v3,w3)=0.113

> sqrt(eigen(A)$values)    #정준상관계수 값만 출력 

[1] 0.9194120 0.4186491 0.1133658 #위의 정준상관계수와 같아짐



#간단하게 
library(CCA)

cc(x,y) #정준상관계수($cor)

--------------------------------------
  
  #정준계수 
  
  
